<template>
 <div class="page">
      <div v-for="item in headerlist" class="box">
        <p class="header">{{item}}</p>
        <div class="main">
          <div v-for="item in mainlist" class="card" @click="click">
            <div>
              <h4 style="color: #6b705c">{{ item.name}}</h4>
              <p style="color: #5a5e66;font-size: 15px">{{ item.start_time}}</p>
              <p style="color: #5a5e66;font-size: 15px">{{ '作者: '+item.contributor_name}}</p>
              <p style="color: #5a5e66;font-size: 15px">{{'关键字: '+item.keyword}}</p>
            </div>
          </div>
        </div>
      </div>g
 </div>
</template>

<script>
export default {
  data(){
    return{
      headerlist:['网络空间安全',
        '先进计算与数据处理',
        '热点与综述',
        '开发研究与工程应用',
        '体系结构与软件技术',
        '移动互联与通信技术',
        '人工智能与模式识别',
        '图形图像处理'],
      mainlist:[{
        name:'基于深度学习的生成式文本摘要技术综述',
        contributor_name:'朱永清1, 赵鹏1, 赵菲菲2, 慕晓冬1, 白坤1, 尤轩昂1',
        start_time: '2021, 47(11): 11-21,28. ',
        abstract_cn:'在互联网数据急剧扩张和深度学习技术高速发展的背景下，自动文本摘要任务作为自然语言处理领域的主要研究方向之一，其相关技术及应用被广泛研究。基于摘要任务深化研究需求，以研究过程中存在的关键问题为导向，介绍现有基于深度学习的生成式文本摘要模型，简述定义及来源、数据预处理及基本框架、常用数据集及评价标准等，指出发展优势和关键问题，并针对关键问题阐述对应的可行性解决方案。对比常用的深度预训练模型和创新方法融合模型，分析各模型的创新性和局限性，提出对部分局限性问题的解决思路。进一步地，对该技术领域的未来发展方向进行展望总结。',
        keyword:' 深度学习, 生成式文本摘要, 未登录词, 生成重复, 长程依赖, 评价标准'
      },{
        name:'基于深度学习的生成式文本摘要技术综述',
        contributor_name:'朱永清1, 赵鹏1, 赵菲菲2, 慕晓冬1, 白坤1, 尤轩昂1',
        start_time: '2021, 47(11): 11-21,28. ',
        abstract_cn:'在互联网数据急剧扩张和深度学习技术高速发展的背景下，自动文本摘要任务作为自然语言处理领域的主要研究方向之一，其相关技术及应用被广泛研究。基于摘要任务深化研究需求，以研究过程中存在的关键问题为导向，介绍现有基于深度学习的生成式文本摘要模型，简述定义及来源、数据预处理及基本框架、常用数据集及评价标准等，指出发展优势和关键问题，并针对关键问题阐述对应的可行性解决方案。对比常用的深度预训练模型和创新方法融合模型，分析各模型的创新性和局限性，提出对部分局限性问题的解决思路。进一步地，对该技术领域的未来发展方向进行展望总结。',
        keyword:' 深度学习, 生成式文本摘要, 未登录词, 生成重复, 长程依赖, 评价标准'
      },{
        name:'基于深度学习的生成式文本摘要技术综述',
        contributor_name:'朱永清1, 赵鹏1, 赵菲菲2, 慕晓冬1, 白坤1, 尤轩昂1',
        start_time: '2021, 47(11): 11-21,28. ',
        abstract_cn:'在互联网数据急剧扩张和深度学习技术高速发展的背景下，自动文本摘要任务作为自然语言处理领域的主要研究方向之一，其相关技术及应用被广泛研究。基于摘要任务深化研究需求，以研究过程中存在的关键问题为导向，介绍现有基于深度学习的生成式文本摘要模型，简述定义及来源、数据预处理及基本框架、常用数据集及评价标准等，指出发展优势和关键问题，并针对关键问题阐述对应的可行性解决方案。对比常用的深度预训练模型和创新方法融合模型，分析各模型的创新性和局限性，提出对部分局限性问题的解决思路。进一步地，对该技术领域的未来发展方向进行展望总结。',
        keyword:' 深度学习, 生成式文本摘要, 未登录词, 生成重复, 长程依赖, 评价标准'
      },{
        name:'基于深度学习的生成式文本摘要技术综述',
        contributor_name:'朱永清1, 赵鹏1, 赵菲菲2, 慕晓冬1, 白坤1, 尤轩昂1',
        start_time: '2021, 47(11): 11-21,28. ',
        abstract_cn:'在互联网数据急剧扩张和深度学习技术高速发展的背景下，自动文本摘要任务作为自然语言处理领域的主要研究方向之一，其相关技术及应用被广泛研究。基于摘要任务深化研究需求，以研究过程中存在的关键问题为导向，介绍现有基于深度学习的生成式文本摘要模型，简述定义及来源、数据预处理及基本框架、常用数据集及评价标准等，指出发展优势和关键问题，并针对关键问题阐述对应的可行性解决方案。对比常用的深度预训练模型和创新方法融合模型，分析各模型的创新性和局限性，提出对部分局限性问题的解决思路。进一步地，对该技术领域的未来发展方向进行展望总结。',
        keyword:' 深度学习, 生成式文本摘要, 未登录词, 生成重复, 长程依赖, 评价标准'
      },{
        name:'基于深度学习的生成式文本摘要技术综述',
        contributor_name:'朱永清1, 赵鹏1, 赵菲菲2, 慕晓冬1, 白坤1, 尤轩昂1',
        start_time: '2021, 47(11): 11-21,28. ',
        abstract_cn:'在互联网数据急剧扩张和深度学习技术高速发展的背景下，自动文本摘要任务作为自然语言处理领域的主要研究方向之一，其相关技术及应用被广泛研究。基于摘要任务深化研究需求，以研究过程中存在的关键问题为导向，介绍现有基于深度学习的生成式文本摘要模型，简述定义及来源、数据预处理及基本框架、常用数据集及评价标准等，指出发展优势和关键问题，并针对关键问题阐述对应的可行性解决方案。对比常用的深度预训练模型和创新方法融合模型，分析各模型的创新性和局限性，提出对部分局限性问题的解决思路。进一步地，对该技术领域的未来发展方向进行展望总结。',
        keyword:' 深度学习, 生成式文本摘要, 未登录词, 生成重复, 长程依赖, 评价标准'
      },{
        name:'基于深度学习的生成式文本摘要技术综述',
        contributor_name:'朱永清1, 赵鹏1, 赵菲菲2, 慕晓冬1, 白坤1, 尤轩昂1',
        start_time: '2021, 47(11): 11-21,28. ',
        abstract_cn:'在互联网数据急剧扩张和深度学习技术高速发展的背景下，自动文本摘要任务作为自然语言处理领域的主要研究方向之一，其相关技术及应用被广泛研究。基于摘要任务深化研究需求，以研究过程中存在的关键问题为导向，介绍现有基于深度学习的生成式文本摘要模型，简述定义及来源、数据预处理及基本框架、常用数据集及评价标准等，指出发展优势和关键问题，并针对关键问题阐述对应的可行性解决方案。对比常用的深度预训练模型和创新方法融合模型，分析各模型的创新性和局限性，提出对部分局限性问题的解决思路。进一步地，对该技术领域的未来发展方向进行展望总结。',
        keyword:' 深度学习, 生成式文本摘要, 未登录词, 生成重复, 长程依赖, 评价标准'
      },]
    }
  },
  methods:{
    click(){
      console.log("nihao")
    }
  }
}
</script>

<style lang="scss" scoped>
.page{
  .box{
    margin: 0 auto;
    padding-left: 100px;
    .header{
      margin: 0px;
      margin-top: 20px;
      line-height: 60px;
      height: 60px;
      width: 200px;
      padding-left: 20px;
      text-align: left;
      background-color: #b7b7a4;
    }
    .main{
      .card{
        background-color: white;
        box-shadow: 0 4px 8px 0 rgba(0, 0, 0, 0.2), 0 6px 20px 0 rgba(0, 0, 0, 0.19);
        border-radius: 4px;
        display: inline-block;
        margin-left: 18px;
        vertical-align: top;
        margin-top: 20px;
        height: 300px;
        width: 300px;
        padding: 20px;

      }
    }
  }
}

</style>
